wiki/2016-09-29-Linux_Fake_File_Access_Modify_and_Change_TimeStamps.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>Linux – Fake File Access, Modify and Change TimeStamps</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">Linux – Fake File Access, Modify and Change TimeStamps</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#linux"><div class="category">linux</div></a> </div>
<div class="char-counter">2016-09-29</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf31b6a6">Get a File’s TimeStamps</a></li>
<li><a href="#org3a38950">Difference Between “atime”, “mtime” and “ctime”</a></li>
<li><a href="#org04a441a">Change File “Access” &amp; “Modification” Time</a>
<ul>
<li><a href="#org62d9ce2">Change a file’s <code>atime</code> (access time):</a></li>
<li><a href="#org899ff03">Change a file’s mtime (modification time):</a></li>
<li><a href="#orgd274d47">Change File “Change” Time</a></li>
</ul>
</li>
<li><a href="#orgbf14dec">Stay Stealthy</a></li>
</ul>
</div>
</nav>
<p>
<i>/Linux – Fake File Access, Modify and Change TimeStamps /</i>
</p>


<p>
Files in Linux have 3 types of timestamps: atime (access), mtime (modify) and
ctime(change).
</p>

<p>
Someday you may have a situation when you would like to fake a timestamps of
some file.
</p>

<p>
atime and mtime timestamps can be easily changed using touch command, but there
is no a standard way to set a different ctimetimestamp.
</p>

<p>
As a possible workaround you can set the system time to the ctime you want to
impose, then touch the file and then restore the system time.
</p>

<p>
Read the below article to learn how to change a file’s timestamps and keep
anonymity.
</p>

<div id="outline-container-orgf31b6a6" class="outline-2">
<h2 id="orgf31b6a6">Get a File’s TimeStamps</h2>
<div class="outline-text-2" id="text-orgf31b6a6">
<p>
Use the <b>stat</b> command to see the current file’s timestamps:
</p>
<pre class="example">
$ stat file.txt
  File: ‘file.txt’
  Size: 0           Blocks: 0          IO Block: 4096   regular empty file
Device: 804h/2052d	Inode: 2501536     Links: 1
Access: (0644/-rw-r--r--)  Uid: ( 1000/     admin)   Gid: ( 1000/     admin)

Access: 2015-02-19 11:43:08.503408793 +0200
Modify: 2015-02-19 11:43:08.503408793 +0200
Change: 2015-02-19 11:43:08.503408793 +0200


</pre>
</div>
</div>

<div id="outline-container-org3a38950" class="outline-2">
<h2 id="org3a38950">Difference Between “atime”, “mtime” and “ctime”</h2>
<div class="outline-text-2" id="text-org3a38950">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Timestamp</th>
<th scope="col" class="org-left">When it gets updated?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">atime</td>
<td class="org-left">Access time gets updated when you open a file or when a file is used for other operations like grep, cat, head and so on.</td>
</tr>

<tr>
<td class="org-left">mtime</td>
<td class="org-left">Modify time gets updated when you whenever update content of a file or save a file.</td>
</tr>

<tr>
<td class="org-left">ctime</td>
<td class="org-left">Change time gets updated when the file attributes are changed, like changing the owner, changing the permission or moving it to another filesystem, but will also be updated when you modify a file.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org04a441a" class="outline-2">
<h2 id="org04a441a">Change File “Access” &amp; “Modification” Time</h2>
<div class="outline-text-2" id="text-org04a441a">
</div>
<div id="outline-container-org62d9ce2" class="outline-3">
<h3 id="org62d9ce2">Change a file’s <code>atime</code> (access time):</h3>
<div class="outline-text-3" id="text-org62d9ce2">
<pre class="example">
$ touch -a --date="1988-02-15" file.txt
$ touch -a --date="1988-02-15 01:00" file.txt
$ touch -a --date="1988-02-15 01:00:17.547775198 +0300" file.txt

</pre>
</div>
</div>

<div id="outline-container-org899ff03" class="outline-3">
<h3 id="org899ff03">Change a file’s mtime (modification time):</h3>
<div class="outline-text-3" id="text-org899ff03">
<pre class="example">
$ touch -m --date="2020-01-20" file.txt
$ touch -m --date="2020-01-20 23:05" file.txt
$ touch -m --date="2020-01-20 23:05:43.443117094 +0400" file.txt

</pre>
</div>
</div>
<div id="outline-container-orgd274d47" class="outline-3">
<h3 id="orgd274d47">Change File “Change” Time</h3>
<div class="outline-text-3" id="text-orgd274d47">
<p>
As i have already said there is no a standard solution to fake a <code>ctime</code> (change
time) timestamp. Nevertheless, if you are ready to risk, it is possible;)
</p>

<p>
Firstly you can set the system time to the <code>ctime</code> you want to impose.
</p>

<p>
Then <code>touch</code> the file and immediately rollback the system time.
</p>

<p>
Unexpected impact: Modification of a system time may cause an unexpected impact!
Use the below commands on your own risk!
</p>

<p>
Save the current system’s date and time in the variable <code>NOW</code>:
</p>
<pre class="example">
$ NOW=$(date)

</pre>

<p>
Set the fake date and time (requires root):
</p>
<pre class="example">
$ date --set "2030-08-15 21:30:11"

</pre>

<p>
Touch the file to fake the all timestamps:
</p>
<pre class="example">
$ touch file.txt

</pre>

<p>
Rollback the date and time (requires root):
</p>
<pre class="example">
$ date --set "$NOW"

</pre>

<p>
To speedup modification and reduce the possible impact, execute the above
commands as follows:
</p>

<pre class="example">
$ NOW=$(date) &amp;&amp; date -s "2030-08-15 21:30:11" &amp;&amp; touch file.txt &amp;&amp; date -s "$NOW"

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf14dec" class="outline-2">
<h2 id="orgbf14dec">Stay Stealthy</h2>
<div class="outline-text-2" id="text-orgbf14dec">
<p>
To stay stealthy – unset the variable, clear logs and history.
</p>

<p>
Unset the variable <code>NOW</code>:
</p>
<pre class="example">
$ unset NOW

</pre>

<p>
Remove the information about changed time from <code>/var/log/messages</code> (requires root):
</p>

<p>
Feb 24 06:32:46 centos7 systemd: Time has been changed
Aug 15 14:30:11 centos7 systemd: Time has been changed
atime and mtime timestamps can be easily changed using touch command, but there is no a standard way to set a different ctime timestamp.
</p>

<p>
Cool Tip: Want to stay anonymous? Learn how to use PROXY on the Linux command line. Read more →
</p>

<p>
Clear the last login history (requires root):&lt;e
</p>
<pre class="example">
$ echo &gt; /var/log/wtmp
$ echo &gt; /var/log/btmp
$ echo &gt; /var/log/lastlog
</pre>

<p>
Clear the history of the current session:
</p>
<pre class="example">
$ history -r

</pre>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
